---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralC
source: html/6bb0e7c4-59c9-39a4-2751-f313e928ef46.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralC

Defines parameters for Channel Cold Formed shape.

## Syntax (C#)
```csharp
public class StructuralSectionGeneralC : StructuralSectionColdFormed
```